// Выяснить являются ли три числа сторонами треугольника
// a+b>c и b+c>a и a+c>b

// void isItTriange()
// {
//     Console.WriteLine("Введите стороны треугольника:");
//     int a = int.Parse(Console.ReadLine());
//     int b = int.Parse(Console.ReadLine());
//     int c = int.Parse(Console.ReadLine());
//     if (a + b > c && b + c > a && a + c > b)
//     {
//         Console.WriteLine("Это треугольник");
//     }
//     else
//     {
//         Console.WriteLine("Это не треугольник");
//     }
// }

// isItTriange();


// Написать программу преобразования десятичного числа в двоичное

// void decInDoub()
// {
//     Console.WriteLine("Введите десятичное число:");
//     int a = int.Parse(Console.ReadLine());
//     int b =0;
//     while (a>0)
//     {
//         b=a%2;
//         a=a/2;
//         Console.WriteLine();

//         if(b==0)
//     {
//         b=1;
//         Console.Write(b);
//     }
//     }
//     }
// }


// decInDoub();

// Показать числа Фибоначчи меньшие заданного числа N

// void Fibonachi()
// {
//     Console.WriteLine("Введите число:");
//     int N = int.Parse(Console.ReadLine());
//     int j = 1;
//     for (int i = 1; i < N; i += j)
//     {
//         Console.Write(i);
//         j = i - j;
//     }
// }

// Fibonachi();

void Harry();
{
Console.WriteLine("Введите длину коридора от 1 до 1000:");
int l= int.Parse(Console.ReadLine());
Console.WriteLine("Введите скорость импульса Гарри (более 1):");
int p = int.Parse(Console.ReadLine());
Console.WriteLine("Введите скорость импульса ТКНН (до 500):");
int q = int.Parse(Console.ReadLine());

}




Harry();